public class Main {
    public static void main(String[] args) {

        // Задание 1

        int comingOfAge = 18;
        if (comingOfAge > 17) {
            System.out.println("Поздравляем с совершенолетием");


        } else {
            System.out.println("Вы не настигли совершенолиьнего возроста");
        }
        // Задание 2


        int age = 7;
        if (age > 8) {
            System.out.println("самое время идти в школу");

        } else {
            System.out.println("В школу еще рано");

        }
        int school3 = 18;
        if (school3 > 16) {
            System.out.println("В твоем возрасте можно в университет");
        } else {
            System.out.println("В универ еще рано");
        }
        int work = 24;
        if (work > 22) {
            System.out.println("Пора искать работу");

        } else {
            System.out.println("работу искать рано");
            // Задание 3
        }
        int passengers = 102;
        if (passengers < 90) {
            System.out.println("Свабодные места, есть");

        } else {
            System.out.println("Свабодных мест нет");


            int kindergarten = 1;
            if (kindergarten < 2 || kindergarten < 6) {
                System.out.println("Если возраст человека равен 2 , то ему нужно ходить детский сад ");

                int school1 = 6;
                if (school1 < 7 || school1 < 16) {
                    System.out.println("Если возраст человека равен 7, то ему нужно ходить в школу");

                    int university = 18;
                    if (university > 16 && university > 24) {
                        System.out.println("Если возраст человека равен 18, то ему нужно ходить в университет");
                    }
                        int work1 = 24;
                        if (work1 >= 20) {
                            System.out.println("Если возраст человека равен 24, то ему нужно ходить на работу");
                        }
                            int kid = 5;
                            if (kid > 4) {
                                System.out.println("неьзя кататься на аттракционах.");

                            }
                                int kid1 = 5;
                                if (kid1 < 10 || kid1 > 14) {
                                    System.out.println("Может кататься в сопровождении взрослого");
                                }
                                    int kid2 = 14;
                                    if ( kid2 > 12){
                                        System.out.println("ТЫ можешь кататься без соправождения");

                                    }
                                }
                            }
                        }
                    }

                }


